In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
sns.set()
import json
import ast
from pandas.io.json import json_normalize

In [2]:
credits = pd.read_csv(r'Dataset\credits.csv', sep=',')
credits.head()

,cast,crew,id
0,"[{'cast_id': 14, 'character': 'Woody (voice)',...","[{'credit_id': '52fe4284c3a36847f8024f49', 'de...",862
1,"[{'cast_id': 1, 'character': 'Alan Parrish', '...","[{'credit_id': '52fe44bfc3a36847f80a7cd1', 'de...",8844
2,"[{'cast_id': 2, 'character': 'Max Goldman', 'c...","[{'credit_id': '52fe466a9251416c75077a89', 'de...",15602
3,"[{'cast_id': 1, 'character': ""Savannah 'Vannah...","[{'credit_id': '52fe44779251416c91011acb', 'de...",31357
4,"[{'cast_id': 1, 'character': 'George Banks', '...","[{'credit_id': '52fe44959251416c75039ed7', 'de...",11862

In [3]:
credits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45476 entries, 0 to 45475
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cast    45476 non-null  object
 1   crew    45476 non-null  object
 2   id      45476 non-null  int64
dtypes: int64(1), object(2)
memory usage: 1.0+ MB

****Transformaciones****

***Verifico id duplicados y los elimino si existen***

In [4]:
credits['id'].duplicated().sum()

44

In [5]:
#credits.drop_duplicates(subset='id',inplace=True)

In [6]:
#credits.info()

***Desaninado de columnas***

Columna 'cast'

In [7]:
#Verifico si hay valores nulos
print(credits['cast'].isna().sum())
print(credits['cast'].isnull().sum())

0
0

In [8]:
# convertimos la cadena JSON en una lista de diccionarios
credits['cast'] = credits['cast'].apply(ast.literal_eval)

In [9]:
#Aplico una función lambda para extraer los valores de 'name' y 'character' para cada diccionario x en cast.
credits['cast_character'] = credits['cast'].apply(lambda x: [charact['character'] for charact in x])
credits['cast_name'] = credits['cast'].apply(lambda x: [name['name'] for name in x])

In [10]:
credits['cast_character']

0        [Woody (voice), Buzz Lightyear (voice), Mr. Po...
1        [Alan Parrish, Samuel Alan Parrish / Van Pelt,...
2        [Max Goldman, John Gustafson, Ariel Gustafson,...
3        [Savannah 'Vannah' Jackson, Bernadine 'Bernie'...
4        [George Banks, Nina Banks, Franck Eggelhoffer,...
                               ...
45471                                               [, , ]
45472    [Sister Angela, Homer, Crazy Woman/Virgin, Ama...
45473    [Emily Shaw, Det. Mark Winston, Jayne Ferré, A...
45474                                           [, , , , ]
45475                                                   []
Name: cast_character, Length: 45476, dtype: object

In [11]:
credits['cast_name']

0        [Tom Hanks, Tim Allen, Don Rickles, Jim Varney...
1        [Robin Williams, Jonathan Hyde, Kirsten Dunst,...
2        [Walter Matthau, Jack Lemmon, Ann-Margret, Sop...
3        [Whitney Houston, Angela Bassett, Loretta Devi...
4        [Steve Martin, Diane Keaton, Martin Short, Kim...
                               ...
45471          [Leila Hatami, Kourosh Tahami, Elham Korda]
45472    [Angel Aquino, Perry Dizon, Hazel Orencio, Joe...
45473    [Erika Eleniak, Adam Baldwin, Julie du Page, J...
45474    [Iwan Mosschuchin, Nathalie Lissenko, Pavel Pa...
45475                                                   []
Name: cast_name, Length: 45476, dtype: object

Columna 'crew'

In [12]:
#Verifico si hay valores nulos
print(credits['crew'].isna().sum())
print(credits['crew'].isnull().sum())

0
0

In [13]:
# convertimos la cadena JSON en una lista de diccionarios
credits['crew'] = credits['crew'].apply(ast.literal_eval)

In [14]:
#Aplico una función lambda para extraer los valores de 'department', 'job y 'name' para cada diccionario x en crew.
credits['crew_job'] = credits['crew'].apply(lambda x: [job['job'] for job in x])
credits['crew_name'] = credits['crew'].apply(lambda x: [name['name'] for name in x])

In [15]:
columnas = ['cast', 'crew']
credits.drop(columns=columnas, inplace=True)

In [16]:
credits.head()

,id,cast_character,cast_name,crew_job,crew_name
0,862,"[Woody (voice), Buzz Lightyear (voice), Mr. Po...","[Tom Hanks, Tim Allen, Don Rickles, Jim Varney...","[Director, Screenplay, Screenplay, Screenplay,...","[John Lasseter, Joss Whedon, Andrew Stanton, J..."
1,8844,"[Alan Parrish, Samuel Alan Parrish / Van Pelt,...","[Robin Williams, Jonathan Hyde, Kirsten Dunst,...","[Executive Producer, Screenplay, Original Musi...","[Larry J. Franco, Jonathan Hensleigh, James Ho..."
2,15602,"[Max Goldman, John Gustafson, Ariel Gustafson,...","[Walter Matthau, Jack Lemmon, Ann-Margret, Sop...","[Director, Characters, Writer, Sound Recordist]","[Howard Deutch, Mark Steven Johnson, Mark Stev..."
3,31357,"[Savannah 'Vannah' Jackson, Bernadine 'Bernie'...","[Whitney Houston, Angela Bassett, Loretta Devi...","[Director, Screenplay, Producer, Producer, Pro...","[Forest Whitaker, Ronald Bass, Ronald Bass, Ez..."
4,11862,"[George Banks, Nina Banks, Franck Eggelhoffer,...","[Steve Martin, Diane Keaton, Martin Short, Kim...","[Original Music Composer, Director of Photogra...","[Alan Silvestri, Elliot Davis, Nancy Meyers, N..."

In [17]:
credits.to_csv('Credits ETL.csv')

A partir de acá hago 2 DF:

1) Para los actores, con las columnas id, cast_character y cast_name: acá pongo un actor por línea o hago la búsqueda dentro del diccionario? cuál la mejor opción?

2) Para los directores con las columnas id, crew_job: En este desanido por línea y luego me quedo sólo con los directores

***Director***

In [18]:
#Creo el DF
director = pd.DataFrame(data= credits, columns=['id', 'crew_job','crew_name'])
director.head()

,id,crew_job,crew_name
0,862,"[Director, Screenplay, Screenplay, Screenplay,...","[John Lasseter, Joss Whedon, Andrew Stanton, J..."
1,8844,"[Executive Producer, Screenplay, Original Musi...","[Larry J. Franco, Jonathan Hensleigh, James Ho..."
2,15602,"[Director, Characters, Writer, Sound Recordist]","[Howard Deutch, Mark Steven Johnson, Mark Stev..."
3,31357,"[Director, Screenplay, Producer, Producer, Pro...","[Forest Whitaker, Ronald Bass, Ronald Bass, Ez..."
4,11862,"[Original Music Composer, Director of Photogra...","[Alan Silvestri, Elliot Davis, Nancy Meyers, N..."

In [25]:
#Desanido la columnas crew_job y crew_name
director = director.explode(['crew_job', 'crew_name'])
director

           id  crew_job         crew_name
0         862  Director     John Lasseter
1        8844  Director      Joe Johnston
2       15602  Director     Howard Deutch
3       31357  Director   Forest Whitaker
4       11862  Director     Charles Shyer
...       ...       ...               ...
45471  439050  Director  Hamid Nematollah
45472  111109  Director          Lav Diaz
45473   67758  Director    Mark L. Lester
45474  227506  Director  Yakov Protazanov
45475  461257  Director     Daisy Asquith

[49048 rows x 3 columns]

In [20]:
#Sólo me interesa el puesto de director, entonces del DF anterior me quedo sólo con esos.
director = director.loc[director['crew_job'] == 'Director']
director

           id  crew_job         crew_name
0         862  Director     John Lasseter
1        8844  Director      Joe Johnston
2       15602  Director     Howard Deutch
3       31357  Director   Forest Whitaker
4       11862  Director     Charles Shyer
...       ...       ...               ...
45471  439050  Director  Hamid Nematollah
45472  111109  Director          Lav Diaz
45473   67758  Director    Mark L. Lester
45474  227506  Director  Yakov Protazanov
45475  461257  Director     Daisy Asquith

[49048 rows x 3 columns]

In [21]:
director.to_csv('Director.csv')

***Cast***

In [22]:
#Creo el DF
cast = pd.DataFrame(data= credits, columns=['id','cast_character','cast_name'])
cast

,id,cast_character,cast_name
0,862,"[Woody (voice), Buzz Lightyear (voice), Mr. Po...","[Tom Hanks, Tim Allen, Don Rickles, Jim Varney..."
1,8844,"[Alan Parrish, Samuel Alan Parrish / Van Pelt,...","[Robin Williams, Jonathan Hyde, Kirsten Dunst,..."
2,15602,"[Max Goldman, John Gustafson, Ariel Gustafson,...","[Walter Matthau, Jack Lemmon, Ann-Margret, Sop..."
3,31357,"[Savannah 'Vannah' Jackson, Bernadine 'Bernie'...","[Whitney Houston, Angela Bassett, Loretta Devi..."
4,11862,"[George Banks, Nina Banks, Franck Eggelhoffer,...","[Steve Martin, Diane Keaton, Martin Short, Kim..."
...,...,...,...
45471,439050,"[, , ]","[Leila Hatami, Kourosh Tahami, Elham Korda]"
45472,111109,"[Sister Angela, Homer, Crazy Woman/Virgin, Ama...","[Angel Aquino, Perry Dizon, Hazel Orencio, Joe..."
45473,67758,"[Emily Shaw, Det. Mark Winston, Jayne Ferré, A...","[Erika Eleniak, Adam Baldwin, Julie du Page, J..."
45474,227506,"[, , , , ]","[Iwan Mosschuchin, Nathalie Lissenko, Pavel Pa..."
45475,461257,[],[]

In [26]:
#Desanido las columnas cast_character y cast_name. En este caso, me quedo con toda la data, todos los actores con los personajes que representaron.
cast = cast.explode(['cast_character', 'cast_name'])
cast

           id           cast_character          cast_name
0         862            Woody (voice)          Tom Hanks
0         862   Buzz Lightyear (voice)          Tim Allen
0         862  Mr. Potato Head (voice)        Don Rickles
0         862       Slinky Dog (voice)         Jim Varney
0         862              Rex (voice)      Wallace Shawn
...       ...                      ...                ...
45474  227506                           Nathalie Lissenko
45474  227506                                Pavel Pavlov
45474  227506                           Aleksandr Chabrov
45474  227506                                 Vera Orlova
45475  461257                      NaN                NaN

[564892 rows x 3 columns]

In [24]:
cast.to_csv('Cast.csv')